# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input("Введите трехзначное число:"))

n,c = divmod(n,10)

a,b = divmod(n,10)

print(a+b+c)